Documents/ESB/ESB_Consumer_0623/003TestSample/SAMPLE_XML_MUST/DepositAccount/DA31_ZeroBalAcctInqRq.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://www.iisigroup.com/magiclamp/common/soapenv.xsd/v1" xmlns:v11="http://www.nextbank.com.tw/xsd/TW/DepositAccount/ZeroBalAcctInqRq/v1">  
  <soap:Header> 
    <v1:Header v1:mustUnderstand="true"> 
      <ChannelID>ESB</ChannelID>  
      <ServiceDomain>DepositAccount</ServiceDomain>  
      <OperationName>ZeroBalAcctInq</OperationName>  
      <ConsumerID>TWESB</ConsumerID>  
      <TransactionID>T1222222</TransactionID>  
      <RqTimestamp>2015-12-06T12:01:01.00+08:00</RqTimestamp> 
    </v1:Header> 
  </soap:Header>  
  <soap:Body> 
    <v11:ZeroBalAcctInqRq> 
      <v11:ServiceHeader> 
        <v11:TxnId>DA31</v11:TxnId>  
        <v11:TxnNo>DA3100001</v11:TxnNo> 
      </v11:ServiceHeader>  
      <v11:Signon> 
        <v11:CustId>ESBUSER</v11:CustId> 
      </v11:Signon>  
      <v11:ServiceBody> 
        <!--Optional:-->  
        <v11:PageInfo> 
          <v11:PageSize>50</v11:PageSize>  
          <v11:PageStart>1</v11:PageStart> 
        </v11:PageInfo>  
        <!--Optional:-->  
        <v11:BrchId>TW8230001</v11:BrchId> 
      </v11:ServiceBody> 
    </v11:ZeroBalAcctInqRq> 
  </soap:Body> 
</soap:Envelope>
